#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan and Apply</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/teamcarljavier/tf-module-pet-test/runs/run-Nwxw1vQMiRxzeLpm

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # module.pet.local_file.html[0m will be created
[0m  [32m+[0m[0m resource "local_file" "html" {
      [32m+[0m[0m content              = (known after apply)
      [32m+[0m[0m directory_permission = "0777"
      [32m+[0m[0m file_permission      = "0777"
      [32m+[0m[0m filename             = "./index.html"
      [32m+[0m[0m id                   = (known after apply)
    }

[1m  # module.pet.random_pet.nickname[0m will be created
[0m  [32m+[0m[0m resource "random_pet" "nickname" {
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m length    = 5
      [32m+[0m[0m separator = "-"
    }

[1m  # module.pet.random_string.random[0m will be created
[0m  [32m+[0m[0m resource "random_string" "random" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 5
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = true
      [32m+[0m[0m upper       = true
    }

[1mPlan:[0m 3 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m random_pet_nickname  = (known after apply)
  [32m+[0m[0m random_string_output = (known after apply)

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 1 estimated
           $0.0/mo +$0.0

```

```terraform

undefined
```

</details>

*Pushed by: @carljavier, Action: `pull_request`*